# Melt()

In [3]:
import pandas as pd

var = pd.DataFrame({"days": [1,2,3,4,5], "eng":[10,12,14,16,18], "maths": [17,18,19,14,16]})
var

   days  eng  maths
0     1   10     17
1     2   12     18
2     3   14     19
3     4   16     14
4     5   18     16

In [8]:
pd.melt(var, id_vars=["eng"], var_name="python", value_name="yash")

   eng python  yash
0   10   days     1
1   12   days     2
2   14   days     3
3   16   days     4
4   18   days     5
5   10  maths    17
6   12  maths    18
7   14  maths    19
8   16  maths    14
9   18  maths    16


# Pivot()

In [14]:
var = pd.DataFrame({"days": [1,2,3,4,5], "stu":list("abcbc") ,"eng":[10,12,14,16,18], "maths": [17,18,19,14,16]})
var

   days stu  eng  maths
0     1   a   10     17
1     2   b   12     18
2     3   c   14     19
3     4   b   16     14
4     5   c   18     16

In [19]:
var.pivot(index="days", columns="stu")

       eng             maths
stu      a     b     c     a     b     c
days
1     10.0   NaN   NaN  17.0   NaN   NaN
2      NaN  12.0   NaN   NaN  18.0   NaN
3      NaN   NaN  14.0   NaN   NaN  19.0
4      NaN  16.0   NaN   NaN  14.0   NaN
5      NaN   NaN  18.0   NaN   NaN  16.0

In [18]:
var.pivot(index="days", columns="stu", values="eng")

stu      a     b     c
days
1     10.0   NaN   NaN
2      NaN  12.0   NaN
3      NaN   NaN  14.0
4      NaN  16.0   NaN
5      NaN   NaN  18.0

In [20]:
# here we can work with this using sum or average finding on such data

In [23]:
var.pivot_table(index = "stu", columns="days",
               aggfunc="sum")

       eng                         maths
days     1     2     3     4     5     1     2     3     4     5
stu
a     10.0   NaN   NaN   NaN   NaN  17.0   NaN   NaN   NaN   NaN
b      NaN  12.0   NaN  16.0   NaN   NaN  18.0   NaN  14.0   NaN
c      NaN   NaN  14.0   NaN  18.0   NaN   NaN  19.0   NaN  16.0

In [25]:
var.pivot_table(index = "stu", columns="days",
               aggfunc="sum", margins=True)

       eng                             maths
days     1     2     3     4     5 All     1     2     3     4     5 All
stu
a     10.0   NaN   NaN   NaN   NaN  10  17.0   NaN   NaN   NaN   NaN  17
b      NaN  12.0   NaN  16.0   NaN  28   NaN  18.0   NaN  14.0   NaN  32
c      NaN   NaN  14.0   NaN  18.0  32   NaN   NaN  19.0   NaN  16.0  35
All   10.0  12.0  14.0  16.0  18.0  70  17.0  18.0  19.0  14.0  16.0  84